CSI API ETABS v1
cDesignCompositeBeam.GetSummaryResults Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetSummaryResults(
	string Name,
	ref int NumberItems,
	ref string[] DesignSect,
	ref double[] BeamFy,
	ref double[] StudDia,
	ref string[] StudLayout,
	ref bool[] BeamShored,
	ref double[] BeamCamber,
	ref string[] PassFail,
	ref double[] ReacLeft,
	ref double[] ReacRt,
	ref double[] MMaxNeg,
	ref double[] MMaxPos,
	ref double[] PCC,
	ref double[] OverallRatio,
	ref double[] StudRatio,
	ref double[] StrPMRat,
	ref double[] ConstPMRat,
	ref double[] StrShrRat,
	ref double[] ConShrRat,
	ref double[] PCDLDfRat,
	ref double[] SDLDfRat,
	ref double[] LLDfRat,
	ref double[] TotCamDfRat,
	ref double[] FreqRat,
	ref double[] MDampRat,
	eItemType ItemType = eItemType.Objects
)
Function GetSummaryResults (
	Name As String,
	ByRef NumberItems As Integer,
	ByRef DesignSect As String(),
	ByRef BeamFy As Double(),
	ByRef StudDia As Double(),
	ByRef StudLayout As String(),
	ByRef BeamShored As Boolean(),
	ByRef BeamCamber As Double(),
	ByRef PassFail As String(),
	ByRef ReacLeft As Double(),
	ByRef ReacRt As Double(),
	ByRef MMaxNeg As Double(),
	ByRef MMaxPos As Double(),
	ByRef PCC As Double(),
	ByRef OverallRatio As Double(),
	ByRef StudRatio As Double(),
	ByRef StrPMRat As Double(),
	ByRef ConstPMRat As Double(),
	ByRef StrShrRat As Double(),
	ByRef ConShrRat As Double(),
	ByRef PCDLDfRat As Double(),
	ByRef SDLDfRat As Double(),
	ByRef LLDfRat As Double(),
	ByRef TotCamDfRat As Double(),
	ByRef FreqRat As Double(),
	ByRef MDampRat As Double(),
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cDesignCompositeBeam
Dim Name As String
Dim NumberItems As Integer
Dim DesignSect As String()
Dim BeamFy As Double()
Dim StudDia As Double()
Dim StudLayout As String()
Dim BeamShored As Boolean()
Dim BeamCamber As Double()
Dim PassFail As String()
Dim ReacLeft As Double()
Dim ReacRt As Double()
Dim MMaxNeg As Double()
Dim MMaxPos As Double()
Dim PCC As Double()
Dim OverallRatio As Double()
Dim StudRatio As Double()
Dim StrPMRat As Double()
Dim ConstPMRat As Double()
Dim StrShrRat As Double()
Dim ConShrRat As Double()
Dim PCDLDfRat As Double()
Dim SDLDfRat As Double()
Dim LLDfRat As Double()
Dim TotCamDfRat As Double()
Dim FreqRat As Double()
Dim MDampRat As Double()
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.GetSummaryResults(Name,
	NumberItems, DesignSect, BeamFy,
	StudDia, StudLayout, BeamShored,
	BeamCamber, PassFail, ReacLeft, ReacRt,
	MMaxNeg, MMaxPos, PCC, OverallRatio,
	StudRatio, StrPMRat, ConstPMRat,
	StrShrRat, ConShrRat, PCDLDfRat,
	SDLDfRat, LLDfRat, TotCamDfRat, FreqRat,
	MDampRat, ItemType)
int GetSummaryResults(
	String^ Name,
	int% NumberItems,
	array<String^>^% DesignSect,
	array<double>^% BeamFy,
	array<double>^% StudDia,
	array<String^>^% StudLayout,
	array<bool>^% BeamShored,
	array<double>^% BeamCamber,
	array<String^>^% PassFail,
	array<double>^% ReacLeft,
	array<double>^% ReacRt,
	array<double>^% MMaxNeg,
	array<double>^% MMaxPos,
	array<double>^% PCC,
	array<double>^% OverallRatio,
	array<double>^% StudRatio,
	array<double>^% StrPMRat,
	array<double>^% ConstPMRat,
	array<double>^% StrShrRat,
	array<double>^% ConShrRat,
	array<double>^% PCDLDfRat,
	array<double>^% SDLDfRat,
	array<double>^% LLDfRat,
	array<double>^% TotCamDfRat,
	array<double>^% FreqRat,
	array<double>^% MDampRat,
	eItemType ItemType = eItemType::Objects
)
abstract GetSummaryResults :
        Name : string *
        NumberItems : int byref *
        DesignSect : string[] byref *
        BeamFy : float[] byref *
        StudDia : float[] byref *
        StudLayout : string[] byref *
        BeamShored : bool[] byref *
        BeamCamber : float[] byref *
        PassFail : string[] byref *
        ReacLeft : float[] byref *
        ReacRt : float[] byref *
        MMaxNeg : float[] byref *
        MMaxPos : float[] byref *
        PCC : float[] byref *
        OverallRatio : float[] byref *
        StudRatio : float[] byref *
        StrPMRat : float[] byref *
        ConstPMRat : float[] byref *
        StrShrRat : float[] byref *
        ConShrRat : float[] byref *
        PCDLDfRat : float[] byref *
        SDLDfRat : float[] byref *
        LLDfRat : float[] byref *
        TotCamDfRat : float[] byref *
        FreqRat : float[] byref *
        MDampRat : float[] byref *
        ?ItemType : eItemType
(* Defaults:
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
NumberItems
Type: System.Int32
DesignSect
Type: System.String[]
BeamFy
Type: System.Double[]
StudDia
Type: System.Double[]
StudLayout
Type: System.String[]
BeamShored
Type: System.Boolean[]
BeamCamber
Type: System.Double[]
PassFail
Type: System.String[]
ReacLeft
Type: System.Double[]
ReacRt
Type: System.Double[]
MMaxNeg
Type: System.Double[]
MMaxPos
Type: System.Double[]
PCC
Type: System.Double[]
OverallRatio
Type: System.Double[]
StudRatio
Type: System.Double[]
StrPMRat
Type: System.Double[]
ConstPMRat
Type: System.Double[]
StrShrRat
Type: System.Double[]
ConShrRat
Type: System.Double[]
PCDLDfRat
Type: System.Double[]
SDLDfRat
Type: System.Double[]
LLDfRat
Type: System.Double[]
TotCamDfRat
Type: System.Double[]
FreqRat
Type: System.Double[]
MDampRat
Type: System.Double[]
ItemType (Optional)
Type: ETABSv1.eItemType
Return Value
Type: Int32
See Also
Reference
cDesignCompositeBeam Interface
ETABSv1 Namespace